## Staging: glue
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 26 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.glue_log_group`              |
|        | `aws_cloudwatch_log_stream.glue_log_stream`            |
|        | `aws_glue_catalog_database.rds_db_catalog`             |
|        | `aws_glue_connection.forms_database`                   |
|        | `aws_glue_crawler.forms_historical_data`               |
|        | `aws_glue_crawler.forms_rds_data`                      |
|        | `aws_glue_crawler.forms_test_data`                     |
|        | `aws_glue_job.historical_glue_job`                     |
|        | `aws_glue_job.rds_glue_job`                            |
|        | `aws_glue_job.testgen_glue_job`                        |
|        | `aws_glue_security_configuration.encryption_at_rest`   |
|        | `aws_glue_trigger.rds_glue_trigger`                    |
|        | `aws_iam_policy.glue_crawler`                          |
|        | `aws_iam_policy.glue_etl`                              |
|        | `aws_iam_role.glue_crawler`                            |
|        | `aws_iam_role.glue_etl`                                |
|        | `aws_iam_role_policy_attachment.aws_glue_service_role` |
|        | `aws_iam_role_policy_attachment.glue_crawler`          |
|        | `aws_iam_role_policy_attachment.glue_etl`              |
|        | `aws_iam_role_policy_attachment.glue_etl_service_role` |
|        | `aws_kms_alias.data_export`                            |
|        | `aws_kms_key.aws_glue`                                 |
|        | `aws_s3_object.glue_script`                            |
|        | `aws_s3_object.historical_csv`                         |
|        | `aws_s3_object.historical_glue_script`                 |
|        | `aws_s3_object.testgen_glue_script`                    |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/13143372953).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.aws_glue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aws_glue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "687401027353",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt*",
              + "kms:Describe*",
              + "kms:Encrypt*",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "logs.ca-central-1.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.glue_crawler_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_crawler_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "s3:GetObject"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::mock-etl-bucket/*",
                              + "arn:aws:s3:::mock-datalake-bucket/*",
                            ]
                          + Sid      = "ReadDataLakeS3Buckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # data.aws_iam_policy_document.glue_database_connection will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_database_connection" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetConnection",
              + "glue:GetConnections",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetGlueConnection"
        }
      + statement {
          + actions   = [
              + "rds:DescribeDBInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:rds:ca-central-1:687401027353:db:mock-forms-database-identifier",
            ]
          + sid       = "DescribeFormsDBInstances"
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:123456789012:secret:mock-rds-connector",
            ]
          + sid       = "GetRDSConnectorSecret"
        }
    }

  # data.aws_iam_policy_document.glue_etl_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_etl_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "s3:GetObject"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::mock-etl-bucket/*",
                              + "arn:aws:s3:::mock-datalake-bucket/*",
                            ]
                          + Sid      = "ReadDataLakeS3Buckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:PutObject",
                              + "s3:DeleteObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:s3:::mock-datalake-bucket/*"
                          + Sid      = "WriteDataLakeS3TransformedBuckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + (known after apply),
        ]
    }

  # data.aws_iam_policy_document.glue_kms will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_kms" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "UseGlueKey"
        }
      + statement {
          + actions   = [
              + "logs:AssociateKmsKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/crawlers*",
              + "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/jobs*",
              + "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/sessions*",
            ]
          + sid       = "AssociateKmsKey"
        }
    }

  # aws_cloudwatch_log_group.glue_log_group will be created
  + resource "aws_cloudwatch_log_group" "glue_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/error-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_stream.glue_log_stream will be created
  + resource "aws_cloudwatch_log_stream" "glue_log_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/aws-glue/jobs/error-logs"
      + name           = "rds_glue_job_error_log_stream"
    }

  # aws_glue_catalog_database.rds_db_catalog will be created
  + resource "aws_glue_catalog_database" "rds_db_catalog" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "Source : RDS"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "rds_db_catalog"
      + tags_all     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_connection.forms_database will be created
  + resource "aws_glue_connection" "forms_database" {
      + arn                   = (known after apply)
      + catalog_id            = (known after apply)
      + connection_properties = (sensitive value)
      + connection_type       = "JDBC"
      + id                    = (known after apply)
      + name                  = "forms-database"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + physical_connection_requirements {
          + availability_zone      = "mock-ca-central-1"
          + security_group_id_list = [
              + "mock-sg-12345678",
            ]
          + subnet_id              = "mock-sg-12345678"
        }
    }

  # aws_glue_crawler.forms_historical_data will be created
  + resource "aws_glue_crawler" "forms_historical_data" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 2
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "rds_db_catalog"
      + description            = "Classify the Forms Historical data"
      + id                     = (known after apply)
      + name                   = "Historical Usage Report"
      + role                   = (known after apply)
      + schedule               = "cron(00 7 1 * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "rds_report_"
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-datalake-bucket/historical-data"
        }
    }

  # aws_glue_crawler.forms_rds_data will be created
  + resource "aws_glue_crawler" "forms_rds_data" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 3
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "rds_db_catalog"
      + description            = "Classify the Forms RDS data"
      + id                     = (known after apply)
      + name                   = "RDS Usage Report"
      + role                   = (known after apply)
      + schedule               = "cron(00 7 1 * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "rds_report_"
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-datalake-bucket/processed-data/template/"
        }
      + s3_target {
          + path = "s3://mock-datalake-bucket/processed-data/user/"
        }
      + s3_target {
          + path = "s3://mock-datalake-bucket/processed-data/templateToUser/"
        }
    }

  # aws_glue_crawler.forms_test_data will be created
  + resource "aws_glue_crawler" "forms_test_data" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 2
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "rds_db_catalog"
      + description            = "Classify the Forms Test data"
      + id                     = (known after apply)
      + name                   = "Test Usage Report"
      + role                   = (known after apply)
      + schedule               = "cron(00 7 1 * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "rds_report_"
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-datalake-bucket/test_data"
        }
    }

  # aws_glue_job.historical_glue_job will be created
  + resource "aws_glue_job" "historical_glue_job" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/error-logs"
          + "--continuous-log-logStreamPrefix"   = "rds_glue_job_error_log_stream"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--historical_csv"                   = "s3://mock-etl-bucket/historical_data.csv"
          + "--rds_bucket"                       = "mock-datalake-bucket"
          + "--s3_bucket"                        = "s3://mock-etl-bucket/historical_data.csv"
        }
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "historical_glue_job"
      + number_of_workers      = (known after apply)
      + role_arn               = (known after apply)
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://mock-etl-bucket/historical_etl.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.rds_glue_job will be created
  + resource "aws_glue_job" "rds_glue_job" {
      + arn                    = (known after apply)
      + connections            = [
          + "forms-database",
        ]
      + default_arguments      = {
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/error-logs"
          + "--continuous-log-logStreamPrefix"   = "rds_glue_job_error_log_stream"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--rds_bucket"                       = "mock-datalake-bucket"
          + "--rds_connection_name"              = "forms-database"
          + "--s3_endpoint"                      = "s3://"
        }
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "rds_glue_job"
      + number_of_workers      = (known after apply)
      + role_arn               = (known after apply)
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://mock-etl-bucket/rds_etl.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.testgen_glue_job will be created
  + resource "aws_glue_job" "testgen_glue_job" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--connection_name"                  = "rds_connection"
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/error-logs"
          + "--continuous-log-logStreamPrefix"   = "rds_glue_job_error_log_stream"
          + "--database_name"                    = "rds_db_catalog"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--num_partitions"                   = "1"
          + "--output_s3_path"                   = "s3://mock-datalake-bucket/test_data/"
          + "--table_name"                       = "rds_report_processed_data"
        }
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "testgen_glue_job"
      + number_of_workers      = (known after apply)
      + role_arn               = (known after apply)
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://mock-etl-bucket/generate_tests_etl.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_security_configuration.encryption_at_rest will be created
  + resource "aws_glue_security_configuration" "encryption_at_rest" {
      + id   = (known after apply)
      + name = "encryption-at-rest"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "SSE-KMS"
              + kms_key_arn                = (known after apply)
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "CSE-KMS"
              + kms_key_arn                   = (known after apply)
            }
          + s3_encryption {
              + s3_encryption_mode = "SSE-S3"
            }
        }
    }

  # aws_glue_trigger.rds_glue_trigger will be created
  + resource "aws_glue_trigger" "rds_glue_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "rds_glue_trigger"
      + schedule = "cron(0 0 * * ? *)"
      + state    = (known after apply)
      + tags_all = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + type     = "SCHEDULED"

      + actions {
          + job_name = "rds_glue_job"
        }
    }

  # aws_iam_policy.glue_crawler will be created
  + resource "aws_iam_policy" "glue_crawler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AWSGlueCrawler-DataLake"
      + name_prefix      = (known after apply)
      + path             = "/service-role/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.glue_etl will be created
  + resource "aws_iam_policy" "glue_etl" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AWSGlueETL-DataLake"
      + name_prefix      = (known after apply)
      + path             = "/service-role/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.glue_crawler will be created
  + resource "aws_iam_role" "glue_crawler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AWSGlueCrawler-DataLake"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.glue_etl will be created
  + resource "aws_iam_role" "glue_etl" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AWSGlueETL-DataLake"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_glue_service_role will be created
  + resource "aws_iam_role_policy_attachment" "aws_glue_service_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "AWSGlueCrawler-DataLake"
    }

  # aws_iam_role_policy_attachment.glue_crawler will be created
  + resource "aws_iam_role_policy_attachment" "glue_crawler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "AWSGlueCrawler-DataLake"
    }

  # aws_iam_role_policy_attachment.glue_etl will be created
  + resource "aws_iam_role_policy_attachment" "glue_etl" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "AWSGlueETL-DataLake"
    }

  # aws_iam_role_policy_attachment.glue_etl_service_role will be created
  + resource "aws_iam_role_policy_attachment" "glue_etl_service_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "AWSGlueETL-DataLake"
    }

  # aws_kms_alias.data_export will be created
  + resource "aws_kms_alias" "data_export" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/aws-glue"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.aws_glue will be created
  + resource "aws_kms_key" "aws_glue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "AWS Glue encryption key for data at rest"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_s3_object.glue_script will be created
  + resource "aws_s3_object" "glue_script" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mock-etl-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "21b251d30bd0c7626213092ffc252dae"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "rds_etl.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./scripts/rds_etl.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.historical_csv will be created
  + resource "aws_s3_object" "historical_csv" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mock-etl-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "616a45498ad736cbe510d557c935a2e6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "historical_data.csv"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./data/historical_data.csv"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.historical_glue_script will be created
  + resource "aws_s3_object" "historical_glue_script" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mock-etl-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "9576cb5461d9ae3e1682e18958b27516"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "historical_etl.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./scripts/historical_etl.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.testgen_glue_script will be created
  + resource "aws_s3_object" "testgen_glue_script" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mock-etl-bucket"
      + bucket_key_enabled     =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.glue_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.rds_db_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_connection.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_historical_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_rds_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.historical_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.rds_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.testgen_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.rds_glue_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.glue_script"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_csv"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_glue_script"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.testgen_glue_script"]

38 tests, 19 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
